app/Controllers/Equipements.php

SELECT *
FROM `categorie`
SELECT *
FROM `marque`
---
    public function new()
    {
        $data['categories'] = $this->categorieModel->findAll();
        $data['marques']    = $this->marqueModel->findAll();

SELECT *
FROM `categorie`
SELECT *
FROM `marque`
INSERT INTO `equipement` (`modele`, `prix_unitaire`, `quantite_stock`, `id_categorie`, `id_marque`) VALUES ('Modele1', '10000', '30', '1', '2')
---
    public function create()
    {
        $rules = [
            'modele'         => 'required|min_length[2]',
            'prix_unitaire'  => 'required|decimal',
            'quantite_stock' => 'required|integer',
            'id_categorie'   => 'required|integer',
            'id_marque'      => 'required|integer',
        ];

        if (! $this->validate($rules)) {
            $data['categories'] = $this->categorieModel->findAll();
            $data['marques']    = $this->marqueModel->findAll();
            $data['validation'] = $this->validator;

            return view('equipements/create', $data);
        }

        $this->equipementModel->insert([
            'modele'         => $this->request->getPost('modele'),
            'prix_unitaire'  => $this->request->getPost('prix_unitaire'),
            'quantite_stock' => $this->request->getPost('quantite_stock'),
            'id_categorie'   => $this->request->getPost('id_categorie'),
            'id_marque'      => $this->request->getPost('id_marque'),
        ]);