app/Models/EquipementModel.php

    public function getEquipementsWithDetails(): array
    {
        return $this->select('equipement.*, categorie.nom_categorie, marque.nom_marque')
                    ->join('categorie', 'categorie.id_categorie = equipement.id_categorie')
                    ->join('marque', 'marque.id_marque = equipement.id_marque')
                    ->findAll();
---
SELECT `equipement`.*, `categorie`.`nom_categorie`, `marque`.`nom_marque`
FROM `equipement`
JOIN `categorie` ON `categorie`.`id_categorie` = `equipement`.`id_categorie`
JOIN `marque` ON `marque`.`id_marque` = `equipement`.`id_marque`